app/views/drinks/_form.html.erb

    <%= f.label :shop %><br>
    <%= f.select :shop_id, Shop.all.collect { |p| [ p.name, p.id ] }, include_blank: "Select A Coffee Shop" %>
---
SELECT "shops".* FROM "shops"