app/controllers/drinks_controller.rb

SELECT "drinks".* FROM "drinks"
---
  def index
    @drinks = Drink.all

SELECT "shops".* FROM "shops"
---
  def new
    @drink = Drink.new
    @shops = Shop.all