app/controllers/drinks_controller.rb

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @drink = Drink.find(params[:id])

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def new
    @shop = Shop.find(params[:shop_id])

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @shop = Shop.find(params[:shop_id])
    @drink = Drink.find(params[:id])

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
INSERT INTO "drinks" ("name", "kind_of_drink", "roast", "flavor", "shop_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Latte"], ["kind_of_drink", "Great"], ["roast", "Medium"], ["flavor", "Delicious"], ["shop_id", 4], ["created_at", 2016-08-02 14:30:38 UTC], ["updated_at", 2016-08-02 14:30:38 UTC]]
---
  def create
    @shop = Shop.find(params[:shop_id])
    @drink = @shop.drinks.create(drink_params)

SELECT  "shops".* FROM "shops" WHERE "shops"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "drinks" SET "kind_of_drink" = $1, "flavor" = $2, "updated_at" = $3 WHERE "drinks"."id" = $4  [["kind_of_drink", "delicious"], ["flavor", "Taste"], ["updated_at", 2016-08-04 00:24:22 UTC], ["id", 18]]
---
  def update
    @shop = Shop.find(params[:shop_id])
    @drink = Drink.find(params[:id])

    if @drink.update(drink_params)

SELECT  "drinks".* FROM "drinks" WHERE "drinks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "drinks" WHERE "drinks"."id" = $1  [["id", 1]]
---
  def destroy
    @drink = Drink.find(params[:id])
    @drink.destroy